SELECT USER
FROM DUAL; 
--==>> SCOTT

--○ 과제
--   본인이 태어나서 현재까지
--   얼마만큼의 일, 시간, 분, 초를 살았는지...(살고있는지...)
--   조회하는 쿼리문을 구성한다.

/*
-----------------------------------------------------------------------
현재 시각	  		 | 태어난 시각 			|  일   | 시간 | 분  | 초 |
-----------------------------------------------------------------------
2021-03-29 14:34:27	 | 1997-10-22 19:10:00	| XXXXX |  XX  | XX  | XX
-----------------------------------------------------------------------
*/

ALTER SESSION SET NLS_DATE_FORMAT = 'YYYY-MM-DD HH24:MI:SS';
--==>> Session이(가) 변경되었습니다.

SELECT SYSDATE
FROM DUAL;
--==>> 2021-03-29 23:08:09

SELECT TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')
FROM DUAL;
--==>> 1997-10-22 19:10:00

-- 현재 날짜 - 태어난 날을 일수로 계산
SELECT SYSDATE - TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')
FROM DUAL;
--==>> 8559.166423611111111111111111111111111111

-- 일수를 초로 환산 
SELECT (SYSDATE - TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')) * (24*60*60)
FROM DUAL;
--==>> 739512087


SELECT TRUNC(TRUNC(TRUNC((SYSDATE - TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')) * (24*60*60)/60)/60)/24) "일"
     , MOD(TRUNC(TRUNC((SYSDATE - TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')) * (24*60*60)/60)/60), 24) "시간"
     , MOD(TRUNC((SYSDATE - TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')) * (24*60*60)/60), 60) "분"
     , MOD((SYSDATE - TO_DATE('1997-10-22 19:10:00', 'YYYY-MM-DD HH24:MI:SS')) * (24*60*60), 60) "초" 
FROM DUAL;
--==>> 
/*
 일	 시간	분	초
8559	4	20	15
*/





